Revit 2027 API
BuiltInFailures.CreationFailures.CannotMakeSurface Property
 Can't construct surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMakeSurface { get; }
Public Shared ReadOnly Property CannotMakeSurface As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMakeSurface {
	FailureDefinitionId^ get ();
}
static member CannotMakeSurface : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace